{
  "data": [
    {
      "title": "The Movie DataBase",
      "brief": "Looking to watch a movie or tv series and don't know in which platform to stream it? This app is for you. My first React project. It's a Front-End connected to an API that, regarding your IP location will serve you where to watch it.",
      "technologies": ["JavaScript", "React", "Redux", "Chakra UI"],
      "url": "https://tmdb-scarpati.vercel.app/"
    },
    {
      "title": "Crypto Prode",
      "brief": "The prode is kind of a fantasy football game, very popular in Argentina. The Crypto Prode was intended as a game to be played during the FIFA World Cup hosted in Qatar. Solution developed in Solidity, contract never left GitHub.",
      "technologies": ["JavaScript", "React", "Next.js", "Solidity"],
      "url": "https://github.com/diego-scarpati/crypto-prode"
    },
    {
      "title": "Portfolio App",
      "brief": "By clicking here you'll have access to the Github repository to the code of this portfolio.",
      "technologies": ["TypeScript", "React", "Next.js", "Redux", "Tailwind"],
      "url": "https://github.com/diego-scarpati/portfolio-app"
    },
    {
      "title": "Shine & Care Website",
      "brief": "A landing page for an Australian cleaning company on the Northern Beaches area. Built with Next.js and Tailwind CSS, it features a modern, responsive design with smooth scrolling and clear calls to action.",
      "technologies": ["TypeScript", "React", "Next.js", "Tailwind CSS", "V0"],
      "url": "https://github.com/diego-scarpati/THMP"
    },
    {
      "title": "The Hire Me Project - Backend",
      "brief": "A Node.js and TypeScript backend that automates job ingestion and analysis. It scrapes job listings from LinkedIn and Seek, deduplicates and normalizes data, stores it in a PostgreSQL database using Sequelize, and applies rule-based and AI-driven filters to evaluate job suitability. The backend also integrates with OpenAI for resume parsing, job matching, and cover letter generation.",
      "technologies": [
        "TypeScript",
        "Node.js",
        "Express",
        "PostgreSQL",
        "Sequelize",
        "OpenAI API",
        "JSDOM",
        "Swagger"
      ],
      "url": "https://github.com/diego-scarpati/THMP"
    },
    {
      "title": "The Hire Me Project - Frontend",
      "brief": "A modern frontend application for exploring, filtering, and evaluating job opportunities processed by THMP. Built with Next.js and React, it provides advanced filtering, keyword highlighting, AI approval indicators, and a clean, responsive UI focused on usability and performance.",
      "technologies": [
        "TypeScript",
        "React",
        "Next.js",
        "Tailwind CSS",
        "Client-side filtering",
        "REST APIs"
      ],
      "url": "https://github.com/diego-scarpati/THMP_Front"
    }
  ]
}
